# What Exactly is Pandas

### Pandas
- pandas is a open source python library used for work with data sets
- its has various functions for analyzing ,cleaning,exploring and manipulating data

#### Why to use pandas
- pandas allow us to analyze big data and make conclusions based on statistical theories
- Pandas can clean messy data sets and make them readable and relevant

#### What can Pandas do ?
- is there any correlation between two or more columns?
- what is the average value?
- Min and Max Value

Pandas are also able to delete rows that are not relevant, or contains wrong values, like empty or null  values. This is called cleaning the Data.

#### Big Questions
- What is Data Frames ?
- What is Data series ?
- Different operation in Pandas ?

In [3]:
# First step is to import pandas
import pandas as pd
import numpy as np

#### How to create Data Frame 
- Data (np.arange(0,20) 
 - Index Row1
   - column name columns

In [11]:
#Playing with Dataframe

df =pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["column1","column2","column3","column4"])

In [12]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [14]:
# Convert data to Excel and csv
df.to_csv('Test.csv')

#### Accesing the elements
   - iloc - index location (focusing on row and columns)
     - .loc -location(focusing  on only row)

In [22]:
df.loc['Row1']

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

#### Data Series

In [21]:
type(df.loc['Row1'])

pandas.core.series.Series

- DataFrames are combination of many columns
-  Data Series can either be one row or one columnn , whther its  .loc or .iloc

In [28]:
df.iloc[:,:]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [31]:
df.iloc[0:3,0:2]

      column1  column2
Row1        0        1
Row2        4        5
Row3        8        9

In [32]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [33]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [38]:
# Convert Dataframes into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [39]:
# Convert Dataframes into array
df.iloc[:,1:].values.shape

(5, 3)

### How to check null values

In [41]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

### Check unique values

In [45]:
df['column2'].value_counts()  # Here you can see 13 is presnt 1 time, 5 is present 1 time etc.

13    1
5     1
17    1
9     1
1     1
Name: column2, dtype: int64

In [51]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [52]:
df[['column1','column2']]

      column1  column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

# Pandas,Reading CSV files With Various Parameters

In [56]:
df=pd.read_csv("C:/Users/aarti/OneDrive/Documents/Enter at your own risk/Python/Krish/mercedesbenz.csv")

In [57]:
df.head()  #Default take 5 rows

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [61]:
df.describe() #while describe the dataset only integer values are taken into consideration not object values  because you are not aable to findout the mean ,standard deviation max,min of that categorical feature)

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [64]:
#how many categories are present in this categorical column

df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
aq     18
i      18
am     18
u      17
aw     16
l      16
ad     14
au     11
b      11
k      11
as     10
r      10
bc      6
ao      4
c       3
aa      2
q       2
g       1
ab      1
ac      1
Name: X0, dtype: int64

In [66]:
df[df['y']>100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

# CSV

In [67]:
from io import StringIO,BytesIO

In [68]:
data = ('col1,col2,col3\n'
       'x,y,1\n'
       'a,b,2\n'
       'c,d,3')

In [69]:
type(data)

str

In [ ]:
StringIO

In [70]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [73]:
# Read from specific columns
df = pd.read_csv(StringIO(data), usecols =['col1','col3'])
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [74]:
df.to_csv('test.csv')

In [79]:
# specifying columns data types
data = ('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11')
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [82]:
# manually provinding datatype to the whole datset
df =pd.read_csv(StringIO(data),dtype=object)
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [84]:
# you can check datatype
df['a'][1]    #Here [1] is index

'5'

In [90]:
# manually provinding datatype to the columns individually   np.flaot - numpy float
df =pd.read_csv(StringIO(data),dtype={'b':int,'c':np.float,'a':'int64'})
df

   a   b     c    d
0  1   2   3.0  4.0
1  5   6   7.0  8.0
2  9  10  11.0  NaN

In [92]:
type(df['a'][1])

numpy.int64

In [93]:
# Check all the datatype
df.dtypes

a      int64
b      int32
c    float64
d    float64
dtype: object

In [94]:
# Index columns and training parameters , delimiters

In [95]:
data = ('index,a,b,c\n'
       '4,apple,bat,5.7\n'
       '1,orange,cow,10')

In [98]:
pd.read_csv(StringIO(data))

   index       a    b     c
0      4   apple  bat   5.7
1      1  orange  cow  10.0

In [102]:
# How to make the first column as my index column(0,1)

pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
1      orange  cow  10.0

In [133]:
data = ('a,b,c\n'
       '4,apple,bat\n'
       '1,orange,cow')

In [134]:
pd.read_csv(StringIO(data))

   a       b    c
0  4   apple  bat
1  1  orange  cow

In [137]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  1  orange  cow

In [138]:
# combining usecols and index_col
data = ('a,b,c\n'
       '4,apple,bat\n'
       '1,orange,cow,')

In [139]:
pd.read_csv(StringIO(data), usecols=['b','c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [140]:
# Quoting and escape characters, very useful in NLP
data = 'a,b\n"hello,\\"Bob\\",nice to see you",5'

In [141]:
data

'a,b\n"hello,\\"Bob\\",nice to see you",5'

In [142]:
pd.read_csv(StringIO(data),escapechar='\\')

                             a  b
0  hello,"Bob",nice to see you  5